In [8]:
import pandas as pd
import psycopg2
from sqlalchemy import create_engine
from sqlConfig import gkey
import matplotlib.pyplot as plt
import numpy as np

In [2]:
engine = create_engine(gkey)
connection = engine.connect()
print("connected")

connected

In [10]:
data = pd.read_sql('SELECT salaries.emp_no, titles.title, salaries.salary FROM salaries INNER JOIN titles ON salaries.emp_no=titles.emp_no', engine)
data.groupby('title').mean()

                          salary
title
Assistant Engineer  48493.204786
Engineer            48539.781423
Manager             51531.041667
Senior Engineer     48506.751806
Senior Staff        58503.286614
Staff               58465.271904
Technique Leader    48580.505772